 #1 > (больше)- он проверяет, больше ли левое число правого. пример: 
print (120 > 100)
print (35 > 50)
 
#2 < (меньше) - он проверяет, меньше ли левое число правого. пример: 
print (35 < 40)
print (185 < 90)

#3 >= (больше или равно) - он проверяет, больше или равна ли левая число правого. пример:
print (245 >= 163)
print (388 >= 780)

#4 <= (меньше или равно) - он проверяет, меньше или равна ли левое число правой. пример: 
print (60 <= 98)
print (193 <= 89)

#5 == (равно) - он проверяет равны ли числа. пример:
print (30 == 30)
print (89 == 87)

#6 != (не равно) он проверяет не равны ли числа. пример:
print (176 !=  283)
print (230 != 230)