# HMTL - нужен для создания структуры и внутреннего контента веб-страницы, указывая браузеру как отображать текст, 
# картину, видео и другие элементы. Это можно назвать (каркасом).
  
# CSS - нужен для оформления и визуального представления веб-страницы. Он определяет цвета, шрифты, фоны и другие стили,
# делая странцу более привлекательной и удобной для пользователя.

#JacaScript - нужен для создания интерактивных веб-страниц, а также для создание приложенй и игр.
# Он позволяет добавлять динамичный контент.