# <!DOCTYPE html> - с этим тегом мы говорим браузеру что он имеет дело с HMTL формата.
# <hmtl<>/html> - с этим тегом мы говорим браузеру где наинается код, а где заканчивается.
# <head<>/head> - в этом теге пишется информация для браузера.
# <body></body> - в этом теге пишется вся визуальная соствляющая веб страницы.
# <meta> -  в теге пишется мета информация для сайта. 
# <title></title> в этом мы можем назвать имя окошка. 


# <p></p> - параграф нужен для абзац текста.
# h1 - h6 - это названия чего либо на сайте (так же размеры текста).
# <img> - это картина для нашей веб страницы (можем вставить ссылку картины или скачать картину).
# scr(атрибут) - это нужно для img,для того чтобы указать адресс картины чтобы потом это картина отобразилась на веб сайте.
# <button></button> - с ней мы можем создать кнопку на нашем сайте.
# <br> - с этим мы можем переносить текс или картину на следующю строку.