# Control flow - это порядок выполнения операторов и инструкций в программе, который позволяет изменять последовательность выполнение кода.

# Sequence - это упорядочная коллекция элементов, к которым можно обращаться по числовому индексу (начиная с 0).

# Iteration - это процесс многократного выполнения одного и того же набора инструкций для обработки элементов коллекции.

# selection - он чаще всего относится к операторам ветвления, которые позволяют программе принимать решения и выполнять разные локи кода в зависимости от условий.